ecommerce_integrations/unicommerce/tests/fixtures/order-SO5906.json

{
	"successful": true,
	"message": null,
	"errors": [],
	"warnings": null,
	"saleOrderDTO": {
		"code": "SO5906",
		"displayOrderCode": "SINV-00041",
		"channel": "RAINFOREST",
		"displayOrderDateTime": 1624300200000,
		"status": "PROCESSING",
		"created": 1624372534000,
		"updated": 1624372802000,
		"fulfillmentTat": 1624473000000,
		"notificationEmail": "",
		"notificationMobile": "",
		"customerGSTIN": null,
		"cod": false,
		"thirdPartyShipping": false,
		"priority": 0,
		"currencyCode": "INR",
		"customerCode": null,
		"billingAddress": {
			"id": "23854",
			"name": "Jane Doe",
			"addressLine1": "Jane Addr 1",
			"addressLine2": "addr 2 optional",
			"city": "Mumbai",
			"district": "",
			"state": "MH",
			"country": "IN",
			"pincode": "400001",
			"phone": "9999999999",
			"email": null,
			"type": null
		},
		"addresses": [
			{
				"id": "23854",
				"name": "Jane Doe",
				"addressLine1": "Jane Addr 1",
				"addressLine2": "addr 2 optional",
				"city": "Mumbai",
				"district": "",
				"state": "MH",
				"country": "IN",
				"pincode": "400001",
				"phone": "9999999999",
				"email": null,
				"type": null
			}
		],
		"shippingPackages": [
			{
				"code": "TEST00949",
				"channelShipmentCode": null,
				"saleOrderCode": "SO5906",
				"channel": "RAINFOREST",
				"status": "CREATED",
				"shippingPackageType": "DEFAULT",
				"shippingProvider": null,
				"shippingMethod": "Standard-Prepaid",
				"trackingNumber": null,
				"trackingStatus": null,
				"courierStatus": null,
				"estimatedWeight": null,
				"actualWeight": null,
				"customer": "",
				"created": 1624372802000,
				"updated": 1624372802000,
				"dispatched": null,
				"delivered": null,
				"invoice": 0,
				"invoiceCode": null,
				"invoiceDisplayCode": null,
				"invoiceDate": null,
				"noOfItems": 11,
				"city": "Mumbai",
				"collectableAmount": 7028.0,
				"collectedAmount": null,
				"paymentReconciled": false,
				"podCode": null,
				"shippingManifestCode": null,
				"items": {
					"MC-100": {
						"itemSku": "MC-100",
						"itemName": "Microfiber Drying Cloth",
						"itemTypeImageUrl": null,
						"itemTypePageUrl": null,
						"quantity": 11
					}
				},
				"shippingLabelLink": null,
				"irn": null
			}
		],
		"saleOrderItems": [
			{
				"id": 86051,
				"shippingPackageCode": "TEST00949",
				"shippingPackageStatus": "CREATED",
				"facilityCode": "Test-123",
				"facilityName": "JKLT",
				"alternateFacilityCode": null,
				"reversePickupCode": null,
				"shippingAddressId": 23854,
				"packetNumber": 1,
				"combinationIdentifier": null,
				"combinationDescription": null,
				"type": "NORMAL",
				"item": null,
				"shippingMethodCode": "STD",
				"itemName": "Microfiber Drying Cloth",
				"itemSku": "MC-100",
				"sellerSkuCode": "MC-100",
				"channelProductId": "MC-100",
				"imageUrl": null,
				"statusCode": "FULFILLABLE",
				"code": "MC-100-7",
				"shelfCode": "DEFAULT",
				"totalPrice": 638.91,
				"sellingPrice": 638.91,
				"shippingCharges": 0.0,
				"shippingMethodCharges": 0.0,
				"cashOnDeliveryCharges": 0.0,
				"prepaidAmount": 0.0,
				"voucherCode": null,
				"voucherValue": 0.0,
				"storeCredit": 0.0,
				"discount": 9.09,
				"giftWrap": null,
				"giftWrapCharges": 0.0,
				"taxPercentage": null,
				"giftMessage": null,
				"cancellable": true,
				"editAddress": true,
				"reversePickable": false,
				"packetConfigurable": false,
				"created": 1624372534000,
				"updated": 1624372802000,
				"onHold": false,
				"saleOrderItemAlternateId": null,
				"cancellationReason": null,
				"pageUrl": null,
				"color": null,
				"brand": null,
				"size": null,
				"replacementSaleOrderCode": null,
				"bundleSkuCode": null,
				"itemDetailFieldDTOList": [],
				"hsnCode": "",
				"totalIntegratedGst": 0,
				"integratedGstPercentage": 0,
				"totalUnionTerritoryGst": 0,
				"unionTerritoryGstPercentage": 0,
				"totalStateGst": 0,
				"stateGstPercentage": 0,
				"totalCentralGst": 0,
				"centralGstPercentage": 0,
				"maxRetailPrice": 659.0,
				"sellingPriceWithoutTaxesAndDiscount": 648.0,
				"batchDTO": null,
				"shippingChargeTaxPercentage": 0,
				"tcs": 0,
				"itemDetailFields": null,
				"channelSaleOrderItemCode": "MC-100-7"
			},
			{
				"id": 86052,
				"shippingPackageCode": "TEST00949",
				"shippingPackageStatus": "CREATED",
				"facilityCode": "Test-123",
				"facilityName": "JKLT",
				"alternateFacilityCode": null,
				"reversePickupCode": null,
				"shippingAddressId": 23854,
				"packetNumber": 1,
				"combinationIdentifier": null,
				"combinationDescription": null,
				"type": "NORMAL",
				"item": null,
				"shippingMethodCode": "STD",
				"itemName": "Microfiber Drying Cloth",
				"itemSku": "MC-100",
				"sellerSkuCode": "MC-100",
				"channelProductId": "MC-100",
				"imageUrl": null,
				"statusCode": "FULFILLABLE",
				"code": "MC-100-0",
				"shelfCode": "DEFAULT",
				"totalPrice": 638.9,
				"sellingPrice": 638.9,
				"shippingCharges": 0.0,
				"shippingMethodCharges": 0.0,
				"cashOnDeliveryCharges": 0.0,
				"prepaidAmount": 0.0,
				"voucherCode": null,
				"voucherValue": 0.0,
				"storeCredit": 0.0,
				"discount": 9.1,
				"giftWrap": null,
				"giftWrapCharges": 0.0,
				"taxPercentage": null,
				"giftMessage": null,
				"cancellable": true,
				"editAddress": true,
				"reversePickable": false,
				"packetConfigurable": false,
				"created": 1624372534000,
				"updated": 1624372802000,
				"onHold": false,
				"saleOrderItemAlternateId": null,
				"cancellationReason": null,
				"pageUrl": null,
				"color": null,
				"brand": null,
				"size": null,
				"replacementSaleOrderCode": null,
				"bundleSkuCode": null,
				"itemDetailFieldDTOList": [],
				"hsnCode": "",
				"totalIntegratedGst": 0,
				"integratedGstPercentage": 0,
				"totalUnionTerritoryGst": 0,
				"unionTerritoryGstPercentage": 0,
				"totalStateGst": 0,
				"stateGstPercentage": 0,
				"totalCentralGst": 0,
				"centralGstPercentage": 0,
				"maxRetailPrice": 659.0,
				"sellingPriceWithoutTaxesAndDiscount": 648.0,
				"batchDTO": null,
				"shippingChargeTaxPercentage": 0,
				"tcs": 0,
				"itemDetailFields": null,
				"channelSaleOrderItemCode": "MC-100-0"
			},
			{
				"id": 86053,
				"shippingPackageCode": "TEST00949",
				"shippingPackageStatus": "CREATED",
				"facilityCode": "Test-123",
				"facilityName": "JKLT",
				"alternateFacilityCode": null,
				"reversePickupCode": null,
				"shippingAddressId": 23854,
				"packetNumber": 1,
				"combinationIdentifier": null,
				"combinationDescription": null,
				"type": "NORMAL",
				"item": null,
				"shippingMethodCode": "STD",
				"itemName": "Microfiber Drying Cloth",
				"itemSku": "MC-100",
				"sellerSkuCode": "MC-100",
				"channelProductId": "MC-100",
				"imageUrl": null,
				"statusCode": "FULFILLABLE",
				"code": "MC-100-4",
				"shelfCode": "DEFAULT",
				"totalPrice": 638.91,
				"sellingPrice": 638.91,
				"shippingCharges": 0.0,
				"shippingMethodCharges": 0.0,
				"cashOnDeliveryCharges": 0.0,
				"prepaidAmount": 0.0,
				"voucherCode": null,
				"voucherValue": 0.0,
				"storeCredit": 0.0,
				"discount": 9.09,
				"giftWrap": null,
				"giftWrapCharges": 0.0,
				"taxPercentage": null,
				"giftMessage": null,
				"cancellable": true,
				"editAddress": true,
				"reversePickable": false,
				"packetConfigurable": false,
				"created": 1624372534000,
				"updated": 1624372802000,
				"onHold": false,
				"saleOrderItemAlternateId": null,
				"cancellationReason": null,
				"pageUrl": null,
				"color": null,
				"brand": null,
				"size": null,
				"replacementSaleOrderCode": null,
				"bundleSkuCode": null,
				"itemDetailFieldDTOList": [],
				"hsnCode": "",
				"totalIntegratedGst": 0,
				"integratedGstPercentage": 0,
				"totalUnionTerritoryGst": 0,
				"unionTerritoryGstPercentage": 0,
				"totalStateGst": 0,
				"stateGstPercentage": 0,
				"totalCentralGst": 0,
				"centralGstPercentage": 0,
				"maxRetailPrice": 659.0,
				"sellingPriceWithoutTaxesAndDiscount": 648.0,
				"batchDTO": null,
				"shippingChargeTaxPercentage": 0,
				"tcs": 0,
				"itemDetailFields": null,
				"channelSaleOrderItemCode": "MC-100-4"
			},
			{
				"id": 86054,
				"shippingPackageCode": "TEST00949",
				"shippingPackageStatus": "CREATED",
				"facilityCode": "Test-123",
				"facilityName": "JKLT",
				"alternateFacilityCode": null,
				"reversePickupCode": null,
				"shippingAddressId": 23854,
				"packetNumber": 1,
				"combinationIdentifier": null,
				"combinationDescription": null,
				"type": "NORMAL",
				"item": null,
				"shippingMethodCode": "STD",
				"itemName": "Microfiber Drying Cloth",
				"itemSku": "MC-100",
				"sellerSkuCode": "MC-100",
				"channelProductId": "MC-100",
				"imageUrl": null,
				"statusCode": "FULFILLABLE",
				"code": "MC-100-1",
				"shelfCode": "DEFAULT",
				"totalPrice": 638.91,
				"sellingPrice": 638.91,
				"shippingCharges": 0.0,
				"shippingMethodCharges": 0.0,
				"cashOnDeliveryCharges": 0.0,
				"prepaidAmount": 0.0,
				"voucherCode": null,
				"voucherValue": 0.0,
				"storeCredit": 0.0,
				"discount": 9.09,
				"giftWrap": null,
				"giftWrapCharges": 0.0,
				"taxPercentage": null,
				"giftMessage": null,
				"cancellable": true,
				"editAddress": true,
				"reversePickable": false,
				"packetConfigurable": false,
				"created": 1624372534000,
				"updated": 1624372802000,
				"onHold": false,
				"saleOrderItemAlternateId": null,
				"cancellationReason": null,
				"pageUrl": null,
				"color": null,
				"brand": null,
				"size": null,
				"replacementSaleOrderCode": null,
				"bundleSkuCode": null,
				"itemDetailFieldDTOList": [],
				"hsnCode": "",
				"totalIntegratedGst": 0,
				"integratedGstPercentage": 0,
				"totalUnionTerritoryGst": 0,
				"unionTerritoryGstPercentage": 0,
				"totalStateGst": 0,
				"stateGstPercentage": 0,
				"totalCentralGst": 0,
				"centralGstPercentage": 0,
				"maxRetailPrice": 659.0,
				"sellingPriceWithoutTaxesAndDiscount": 648.0,
				"batchDTO": null,
				"shippingChargeTaxPercentage": 0,
				"tcs": 0,
				"itemDetailFields": null,
				"channelSaleOrderItemCode": "MC-100-1"
			},
			{
				"id": 86055,
				"shippingPackageCode": "TEST00949",
				"shippingPackageStatus": "CREATED",
				"facilityCode": "Test-123",
				"facilityName": "JKLT",
				"alternateFacilityCode": null,
				"reversePickupCode": null,
				"shippingAddressId": 23854,
				"packetNumber": 1,
				"combinationIdentifier": null,
				"combinationDescription": null,
				"type": "NORMAL",
				"item": null,
				"shippingMethodCode": "STD",
				"itemName": "Microfiber Drying Cloth",
				"itemSku": "MC-100",
				"sellerSkuCode": "MC-100",
				"channelProductId": "MC-100",
				"imageUrl": null,
				"statusCode": "FULFILLABLE",
				"code": "MC-100-3",
				"shelfCode": "DEFAULT",
				"totalPrice": 638.91,
				"sellingPrice": 638.91,
				"shippingCharges": 0.0,
				"shippingMethodCharges": 0.0,
				"cashOnDeliveryCharges": 0.0,
				"prepaidAmount": 0.0,
				"voucherCode": null,
				"voucherValue": 0.0,
				"storeCredit": 0.0,
				"discount": 9.09,
				"giftWrap": null,
				"giftWrapCharges": 0.0,
				"taxPercentage": null,
				"giftMessage": null,
				"cancellable": true,
				"editAddress": true,
				"reversePickable": false,
				"packetConfigurable": false,
				"created": 1624372534000,
				"updated": 1624372802000,
				"onHold": false,
				"saleOrderItemAlternateId": null,
				"cancellationReason": null,
				"pageUrl": null,
				"color": null,
				"brand": null,
				"size": null,
				"replacementSaleOrderCode": null,
				"bundleSkuCode": null,
				"itemDetailFieldDTOList": [],
				"hsnCode": "",
				"totalIntegratedGst": 0,
				"integratedGstPercentage": 0,
				"totalUnionTerritoryGst": 0,
				"unionTerritoryGstPercentage": 0,
				"totalStateGst": 0,
				"stateGstPercentage": 0,
				"totalCentralGst": 0,
				"centralGstPercentage": 0,
				"maxRetailPrice": 659.0,
				"sellingPriceWithoutTaxesAndDiscount": 648.0,
				"batchDTO": null,
				"shippingChargeTaxPercentage": 0,
				"tcs": 0,
				"itemDetailFields": null,
				"channelSaleOrderItemCode": "MC-100-3"
			},
			{
				"id": 86056,
				"shippingPackageCode": "TEST00949",
				"shippingPackageStatus": "CREATED",
				"facilityCode": "Test-123",
				"facilityName": "JKLT",
				"alternateFacilityCode": null,
				"reversePickupCode": null,
				"shippingAddressId": 23854,
				"packetNumber": 1,
				"combinationIdentifier": null,
				"combinationDescription": null,
				"type": "NORMAL",
				"item": null,
				"shippingMethodCode": "STD",
				"itemName": "Microfiber Drying Cloth",
				"itemSku": "MC-100",
				"sellerSkuCode": "MC-100",
				"channelProductId": "MC-100",
				"imageUrl": null,
				"statusCode": "FULFILLABLE",
				"code": "MC-100-6",
				"shelfCode": "DEFAULT",
				"totalPrice": 638.91,
				"sellingPrice": 638.91,
				"shippingCharges": 0.0,
				"shippingMethodCharges": 0.0,
				"cashOnDeliveryCharges": 0.0,
				"prepaidAmount": 0.0,
				"voucherCode": null,
				"voucherValue": 0.0,
				"storeCredit": 0.0,
				"discount": 9.09,
				"giftWrap": null,
				"giftWrapCharges": 0.0,
				"taxPercentage": null,
				"giftMessage": null,
				"cancellable": true,
				"editAddress": true,
				"reversePickable": false,
				"packetConfigurable": false,
				"created": 1624372534000,
				"updated": 1624372802000,
				"onHold": false,
				"saleOrderItemAlternateId": null,
				"cancellationReason": null,
				"pageUrl": null,
				"color": null,
				"brand": null,
				"size": null,
				"replacementSaleOrderCode": null,
				"bundleSkuCode": null,
				"itemDetailFieldDTOList": [],
				"hsnCode": "",
				"totalIntegratedGst": 0,
				"integratedGstPercentage": 0,
				"totalUnionTerritoryGst": 0,
				"unionTerritoryGstPercentage": 0,
				"totalStateGst": 0,
				"stateGstPercentage": 0,
				"totalCentralGst": 0,
				"centralGstPercentage": 0,
				"maxRetailPrice": 659.0,
				"sellingPriceWithoutTaxesAndDiscount": 648.0,
				"batchDTO": null,
				"shippingChargeTaxPercentage": 0,
				"tcs": 0,
				"itemDetailFields": null,
				"channelSaleOrderItemCode": "MC-100-6"
			},
			{
				"id": 86057,
				"shippingPackageCode": "TEST00949",
				"shippingPackageStatus": "CREATED",
				"facilityCode": "Test-123",
				"facilityName": "JKLT",
				"alternateFacilityCode": null,
				"reversePickupCode": null,
				"shippingAddressId": 23854,
				"packetNumber": 1,
				"combinationIdentifier": null,
				"combinationDescription": null,
				"type": "NORMAL",
				"item": null,
				"shippingMethodCode": "STD",
				"itemName": "Microfiber Drying Cloth",
				"itemSku": "MC-100",
				"sellerSkuCode": "MC-100",
				"channelProductId": "MC-100",
				"imageUrl": null,
				"statusCode": "FULFILLABLE",
				"code": "MC-100-10",
				"shelfCode": "DEFAULT",
				"totalPrice": 638.91,
				"sellingPrice": 638.91,
				"shippingCharges": 0.0,
				"shippingMethodCharges": 0.0,
				"cashOnDeliveryCharges": 0.0,
				"prepaidAmount": 0.0,
				"voucherCode": null,
				"voucherValue": 0.0,
				"storeCredit": 0.0,
				"discount": 9.09,
				"giftWrap": null,
				"giftWrapCharges": 0.0,
				"taxPercentage": null,
				"giftMessage": null,
				"cancellable": true,
				"editAddress": true,
				"reversePickable": false,
				"packetConfigurable": false,
				"created": 1624372534000,
				"updated": 1624372802000,
				"onHold": false,
				"saleOrderItemAlternateId": null,
				"cancellationReason": null,
				"pageUrl": null,
				"color": null,
				"brand": null,
				"size": null,
				"replacementSaleOrderCode": null,
				"bundleSkuCode": null,
				"itemDetailFieldDTOList": [],
				"hsnCode": "",
				"totalIntegratedGst": 0,
				"integratedGstPercentage": 0,
				"totalUnionTerritoryGst": 0,
				"unionTerritoryGstPercentage": 0,
				"totalStateGst": 0,
				"stateGstPercentage": 0,
				"totalCentralGst": 0,
				"centralGstPercentage": 0,
				"maxRetailPrice": 659.0,
				"sellingPriceWithoutTaxesAndDiscount": 648.0,
				"batchDTO": null,
				"shippingChargeTaxPercentage": 0,
				"tcs": 0,
				"itemDetailFields": null,
				"channelSaleOrderItemCode": "MC-100-10"
			},
			{
				"id": 86058,
				"shippingPackageCode": "TEST00949",
				"shippingPackageStatus": "CREATED",
				"facilityCode": "Test-123",
				"facilityName": "JKLT",
				"alternateFacilityCode": null,
				"reversePickupCode": null,
				"shippingAddressId": 23854,
				"packetNumber": 1,
				"combinationIdentifier": null,
				"combinationDescription": null,
				"type": "NORMAL",
				"item": null,
				"shippingMethodCode": "STD",
				"itemName": "Microfiber Drying Cloth",
				"itemSku": "MC-100",
				"sellerSkuCode": "MC-100",
				"channelProductId": "MC-100",
				"imageUrl": null,
				"statusCode": "FULFILLABLE",
				"code": "MC-100-5",
				"shelfCode": "DEFAULT",
				"totalPrice": 638.91,
				"sellingPrice": 638.91,
				"shippingCharges": 0.0,
				"shippingMethodCharges": 0.0,
				"cashOnDeliveryCharges": 0.0,
				"prepaidAmount": 0.0,
				"voucherCode": null,
				"voucherValue": 0.0,
				"storeCredit": 0.0,
				"discount": 9.09,
				"giftWrap": null,
				"giftWrapCharges": 0.0,
				"taxPercentage": null,
				"giftMessage": null,
				"cancellable": true,
				"editAddress": true,
				"reversePickable": false,
				"packetConfigurable": false,
				"created": 1624372534000,
				"updated": 1624372802000,
				"onHold": false,
				"saleOrderItemAlternateId": null,
				"cancellationReason": null,
				"pageUrl": null,
				"color": null,
				"brand": null,
				"size": null,
				"replacementSaleOrderCode": null,
				"bundleSkuCode": null,
				"itemDetailFieldDTOList": [],
				"hsnCode": "",
				"totalIntegratedGst": 0,
				"integratedGstPercentage": 0,
				"totalUnionTerritoryGst": 0,
				"unionTerritoryGstPercentage": 0,
				"totalStateGst": 0,
				"stateGstPercentage": 0,
				"totalCentralGst": 0,
				"centralGstPercentage": 0,
				"maxRetailPrice": 659.0,
				"sellingPriceWithoutTaxesAndDiscount": 648.0,
				"batchDTO": null,
				"shippingChargeTaxPercentage": 0,
				"tcs": 0,
				"itemDetailFields": null,
				"channelSaleOrderItemCode": "MC-100-5"
			},
			{
				"id": 86059,
				"shippingPackageCode": "TEST00949",
				"shippingPackageStatus": "CREATED",
				"facilityCode": "Test-123",
				"facilityName": "JKLT",
				"alternateFacilityCode": null,
				"reversePickupCode": null,
				"shippingAddressId": 23854,
				"packetNumber": 1,
				"combinationIdentifier": null,
				"combinationDescription": null,
				"type": "NORMAL",
				"item": null,
				"shippingMethodCode": "STD",
				"itemName": "Microfiber Drying Cloth",
				"itemSku": "MC-100",
				"sellerSkuCode": "MC-100",
				"channelProductId": "MC-100",
				"imageUrl": null,
				"statusCode": "FULFILLABLE",
				"code": "MC-100-9",
				"shelfCode": "DEFAULT",
				"totalPrice": 638.91,
				"sellingPrice": 638.91,
				"shippingCharges": 0.0,
				"shippingMethodCharges": 0.0,
				"cashOnDeliveryCharges": 0.0,
				"prepaidAmount": 0.0,
				"voucherCode": null,
				"voucherValue": 0.0,
				"storeCredit": 0.0,
				"discount": 9.09,
				"giftWrap": null,
				"giftWrapCharges": 0.0,
				"taxPercentage": null,
				"giftMessage": null,
				"cancellable": true,
				"editAddress": true,
				"reversePickable": false,
				"packetConfigurable": false,
				"created": 1624372534000,
				"updated": 1624372802000,
				"onHold": false,
				"saleOrderItemAlternateId": null,
				"cancellationReason": null,
				"pageUrl": null,
				"color": null,
				"brand": null,
				"size": null,
				"replacementSaleOrderCode": null,
				"bundleSkuCode": null,
				"itemDetailFieldDTOList": [],
				"hsnCode": "",
				"totalIntegratedGst": 0,
				"integratedGstPercentage": 0,
				"totalUnionTerritoryGst": 0,
				"unionTerritoryGstPercentage": 0,
				"totalStateGst": 0,
				"stateGstPercentage": 0,
				"totalCentralGst": 0,
				"centralGstPercentage": 0,
				"maxRetailPrice": 659.0,
				"sellingPriceWithoutTaxesAndDiscount": 648.0,
				"batchDTO": null,
				"shippingChargeTaxPercentage": 0,
				"tcs": 0,
				"itemDetailFields": null,
				"channelSaleOrderItemCode": "MC-100-9"
			},
			{
				"id": 86060,
				"shippingPackageCode": "TEST00949",
				"shippingPackageStatus": "CREATED",
				"facilityCode": "Test-123",
				"facilityName": "JKLT",
				"alternateFacilityCode": null,
				"reversePickupCode": null,
				"shippingAddressId": 23854,
				"packetNumber": 1,
				"combinationIdentifier": null,
				"combinationDescription": null,
				"type": "NORMAL",
				"item": null,
				"shippingMethodCode": "STD",
				"itemName": "Microfiber Drying Cloth",
				"itemSku": "MC-100",
				"sellerSkuCode": "MC-100",
				"channelProductId": "MC-100",
				"imageUrl": null,
				"statusCode": "FULFILLABLE",
				"code": "MC-100-2",
				"shelfCode": "DEFAULT",
				"totalPrice": 638.91,
				"sellingPrice": 638.91,
				"shippingCharges": 0.0,
				"shippingMethodCharges": 0.0,
				"cashOnDeliveryCharges": 0.0,
				"prepaidAmount": 0.0,
				"voucherCode": null,
				"voucherValue": 0.0,
				"storeCredit": 0.0,
				"discount": 9.09,
				"giftWrap": null,
				"giftWrapCharges": 0.0,
				"taxPercentage": null,
				"giftMessage": null,
				"cancellable": true,
				"editAddress": true,
				"reversePickable": false,
				"packetConfigurable": false,
				"created": 1624372534000,
				"updated": 1624372802000,
				"onHold": false,
				"saleOrderItemAlternateId": null,
				"cancellationReason": null,
				"pageUrl": null,
				"color": null,
				"brand": null,
				"size": null,
				"replacementSaleOrderCode": null,
				"bundleSkuCode": null,
				"itemDetailFieldDTOList": [],
				"hsnCode": "",
				"totalIntegratedGst": 0,
				"integratedGstPercentage": 0,
				"totalUnionTerritoryGst": 0,
				"unionTerritoryGstPercentage": 0,
				"totalStateGst": 0,
				"stateGstPercentage": 0,
				"totalCentralGst": 0,
				"centralGstPercentage": 0,
				"maxRetailPrice": 659.0,
				"sellingPriceWithoutTaxesAndDiscount": 648.0,
				"batchDTO": null,
				"shippingChargeTaxPercentage": 0,
				"tcs": 0,
				"itemDetailFields": null,
				"channelSaleOrderItemCode": "MC-100-2"
			},
			{
				"id": 86061,
				"shippingPackageCode": "TEST00949",
				"shippingPackageStatus": "CREATED",
				"facilityCode": "Test-123",
				"facilityName": "JKLT",
				"alternateFacilityCode": null,
				"reversePickupCode": null,
				"shippingAddressId": 23854,
				"packetNumber": 1,
				"combinationIdentifier": null,
				"combinationDescription": null,
				"type": "NORMAL",
				"item": null,
				"shippingMethodCode": "STD",
				"itemName": "Microfiber Drying Cloth",
				"itemSku": "MC-100",
				"sellerSkuCode": "MC-100",
				"channelProductId": "MC-100",
				"imageUrl": null,
				"statusCode": "FULFILLABLE",
				"code": "MC-100-8",
				"shelfCode": "DEFAULT",
				"totalPrice": 638.91,
				"sellingPrice": 638.91,
				"shippingCharges": 0.0,
				"shippingMethodCharges": 0.0,
				"cashOnDeliveryCharges": 0.0,
				"prepaidAmount": 0.0,
				"voucherCode": null,
				"voucherValue": 0.0,
				"storeCredit": 0.0,
				"discount": 9.09,
				"giftWrap": null,
				"giftWrapCharges": 0.0,
				"taxPercentage": null,
				"giftMessage": null,
				"cancellable": true,
				"editAddress": true,
				"reversePickable": false,
				"packetConfigurable": false,
				"created": 1624372534000,
				"updated": 1624372802000,
				"onHold": false,
				"saleOrderItemAlternateId": null,
				"cancellationReason": null,
				"pageUrl": null,
				"color": null,
				"brand": null,
				"size": null,
				"replacementSaleOrderCode": null,
				"bundleSkuCode": null,
				"itemDetailFieldDTOList": [],
				"hsnCode": "",
				"totalIntegratedGst": 0,
				"integratedGstPercentage": 0,
				"totalUnionTerritoryGst": 0,
				"unionTerritoryGstPercentage": 0,
				"totalStateGst": 0,
				"stateGstPercentage": 0,
				"totalCentralGst": 0,
				"centralGstPercentage": 0,
				"maxRetailPrice": 659.0,
				"sellingPriceWithoutTaxesAndDiscount": 648.0,
				"batchDTO": null,
				"shippingChargeTaxPercentage": 0,
				"tcs": 0,
				"itemDetailFields": null,
				"channelSaleOrderItemCode": "MC-100-8"
			}
		],
		"returns": [],
		"cancellable": true,
		"reversePickable": false,
		"packetConfigurable": false,
		"cFormProvided": false,
		"totalDiscount": null,
		"totalShippingCharges": null,
		"additionalInfo": null
	},
	"refreshEnabled": false,
	"failedOrderFetch": false
}
